{"modelTopology":{"class_name":"Sequential","config":[{"class_name":"Dense","config":{"units":11,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense131181","trainable":true,"batch_input_shape":[null,14],"dtype":"float32"}},{"class_name":"Dense","config":{"units":4,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense131182","trainable":true}}],"keras_version":"tfjs-layers 1.0.4","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.0.4","convertedBy":null,"weightsManifest":[{"paths":["./bestSnake.weights.bin"],"weights":[{"name":"dense_Dense131181/kernel","shape":[14,11],"dtype":"float32"},{"name":"dense_Dense131181/bias","shape":[11],"dtype":"float32"},{"name":"dense_Dense131182/kernel","shape":[11,4],"dtype":"float32"},{"name":"dense_Dense131182/bias","shape":[4],"dtype":"float32"}]}]}